In [1]:
from ydata_profiling import ProfileReport
import pandas as pd
import numpy as np
import pandas_datareader as pdr  # to install: !pip install pandas_datareader
from datetime import datetime
url = 'https://github.com/LeDataSciFi/data/raw/main/Firm%20Year%20Datasets%20(Compustat)/firms2020.csv'
firms_df = pd.read_csv(url).drop_duplicates('tic')

bod_df = pd.read_csv('./Input_data/BOD_Comp_Company_Fin.csv')
ceo_df = pd.read_csv('./Input_data/CEO_Comp_Fin.csv')
sp500_tickers = pd.read_csv('./Input_data/sp500_2022.csv')['Symbol'].tolist()
test_df = pd.read_csv('./Input_data/directorstest.csv')

In [2]:
bod_df = bod_df.drop(['NAICS', 'PCOMMFEES', 'PEXECDIRPD', 'EPSEX', 'EPSEXCHG', 'EPSEX3LS', 'EPSEX5LS', 'OIBD3LS'], axis=1)
bod_df = bod_df.drop(['OIBDCHG', 'OIBD5LS', 'SALE3LS', 'SALE5LS', 'NI3LS', 'NI5LS', 'PDIRPENSN', 'DIRMTGFEE'], axis=1)
bod_df = bod_df.drop(['NUMMTGS', 'TRS1YR', 'TRS3YR', 'TRS5YR', 'AJEX', 'BS_YIELD', 'BS_VOLATILITY'], axis=1)

bod_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 36 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ANNDIRRET  4530 non-null   float64
 1   DIRSTK     4530 non-null   float64
 2   DIRSTKAD   4530 non-null   float64
 3   DIROPT     2278 non-null   float64
 4   DIROPTAD   4530 non-null   float64
 5   SALES      5207 non-null   float64
 6   SALECHG    5052 non-null   float64
 7   OIBD       4938 non-null   float64
 8   PRETAX     5207 non-null   float64
 9   NIBEX      5207 non-null   float64
 10  NI         5207 non-null   float64
 11  NICHG      4266 non-null   float64
 12  NIAC       5207 non-null   float64
 13  EPSIN      5200 non-null   float64
 14  EPSINCHG   4251 non-null   float64
 15  COMMEQ     5209 non-null   float64
 16  SEQ        5210 non-null   float64
 17  ROEPER     5111 non-null   float64
 18  ROEAVG     4967 non-null   float64
 19  ASSETS     5210 non-null   float64
 20  ASSETCHG   5056 non-null   float64
 21  ROA        5207 non-null   float64
 22  MKTVAL     5212 non-null   float64
 23  DIVYIELD   5218 non-null   float64
 24  PRCCF      5218 non-null   float64
 25  PRCC       5220 non-null   float64
 26  SHRSOUT    5374 non-null   float64
 27  EMPL       5222 non-null   float64
 28  SRCDATE    4656 non-null   object
 29  GVKEY      7000 non-null   int64
 30  YEAR       7000 non-null   int64
 31  FYR        5449 non-null   float64
 32  CONAME     7000 non-null   object
 33  CUSIP      7000 non-null   object
 34  TICKER     7000 non-null   object
 35  SIC        7000 non-null   int64
dtypes: float64(29), int64(3), object(4)
memory usage: 1.9+ MB

In [3]:
ceo_df = ceo_df.drop(['CFOANN', 'PENSION_CHG', 'TOTAL_SEC', 'CHG_CTRL_PYMT', 'TOTAL_SEC_PCT', 'REPRICE', 'PCFO', 'EXECRANK'], axis=1)
ceo_df = ceo_df[ceo_df['CEOANN'].notnull()]
ceo_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4268 entries, 0 to 28946
Data columns (total 35 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EXECDIR         4268 non-null   int64
 1   CO_PER_ROL      4268 non-null   int64
 2   CONAME          4268 non-null   object
 3   CEOANN          4268 non-null   object
 4   SALARY          4268 non-null   float64
 5   BONUS           4268 non-null   float64
 6   TOTAL_CURR      4268 non-null   float64
 7   AGE             3963 non-null   float64
 8   EXECRANKANN     4260 non-null   float64
 9   TDC1            4234 non-null   float64
 10  ALLOTHTOT       4268 non-null   float64
 11  ALLOTHPD        4268 non-null   float64
 12  SAL_PCT         4050 non-null   float64
 13  TOTAL_CURR_PCT  4049 non-null   float64
 14  TDC1_PCT        3969 non-null   float64
 15  COMMENT         395 non-null    object
 16  GVKEY           4268 non-null   int64
 17  EXECID          4268 non-null   int64
 18  YEAR            4268 non-null   int64
 19  BECAMECEO       4190 non-null   object
 20  JOINED_CO       2672 non-null   object
 21  REJOIN          53 non-null     object
 22  LEFTOFC         3895 non-null   object
 23  LEFTCO          1751 non-null   object
 24  RELEFT          28 non-null     object
 25  PCEO            220 non-null    object
 26  TITLE           4268 non-null   object
 27  REASON          1780 non-null   object
 28  EXEC_LNAME      4268 non-null   object
 29  EXEC_FNAME      4268 non-null   object
 30  GENDER          4268 non-null   object
 31  PAGE            4257 non-null   float64
 32  CUSIP           4268 non-null   object
 33  TICKER          4268 non-null   object
 34  NAICS           4268 non-null   int64
dtypes: float64(12), int64(6), object(17)
memory usage: 1.2+ MB

In [4]:
# # profile report for training data Note: only need to run once
# profile = ProfileReport(bod_df, 
#                         title='Profiling Report',
#                         html={'style':{'full_width':True}})

In [5]:
# profile.to_file("./data_description/BOD_training.html")

In [6]:
# # profile report for training data Note: only need to run once
# profile = ProfileReport(ceo_df, 
#                         title='Profiling Report',
#                         html={'style':{'full_width':True}})

In [7]:
# profile.to_file("./data_description/CEO_training.html")

In [8]:
ceo_df.head()

,EXECDIR,CO_PER_ROL,CONAME,CEOANN,SALARY,BONUS,TOTAL_CURR,AGE,EXECRANKANN,TDC1,...,PCEO,TITLE,REASON,EXEC_LNAME,EXEC_FNAME,GENDER,PAGE,CUSIP,TICKER,NAICS
0,1,1,AMERICAN AIRLINES GROUP INC,CEO,600.0,0.00,600.00,NaN,1.0,1013.471,...,NaN,"chmn., pres. & CEO",RETIRED,Crandall,Robert,MALE,87.0,02376R10,AAL,481111
5,1,1,AMERICAN AIRLINES GROUP INC,CEO,600.0,0.00,600.00,58.0,1.0,1003.974,...,NaN,"chmn., pres. & CEO",RETIRED,Crandall,Robert,MALE,87.0,02376R10,AAL,481111
11,1,1,AMERICAN AIRLINES GROUP INC,CEO,600.0,395.00,995.00,59.0,1.0,1410.361,...,NaN,"chmn., pres. & CEO",RETIRED,Crandall,Robert,MALE,87.0,02376R10,AAL,481111
17,1,1,AMERICAN AIRLINES GROUP INC,CEO,662.5,678.40,1340.90,60.0,1.0,4741.184,...,NaN,"chmn., pres. & CEO",RETIRED,Crandall,Robert,MALE,87.0,02376R10,AAL,481111
23,1,1,AMERICAN AIRLINES GROUP INC,CEO,750.0,851.25,1601.25,61.0,1.0,5894.280,...,NaN,"chmn., pres. & CEO",RETIRED,Crandall,Robert,MALE,87.0,02376R10,AAL,481111

In [9]:
bod_df['NI'].describe()

count     5207.000000
mean       655.564534
std       1910.647540
min     -23498.300000
25%         45.373000
50%        195.868000
75%        600.250000
max      36130.000000
Name: NI, dtype: float64

In [10]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28953 entries, 0 to 28952
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EXECDIR         28953 non-null  int64
 1   CO_PER_ROL      28953 non-null  int64
 2   TOTAL_SEC       0 non-null      float64
 3   TOTAL_CURR      28953 non-null  float64
 4   TOTAL_ALT1      0 non-null      float64
 5   TOTAL_ALT2      0 non-null      float64
 6   AGE             10245 non-null  float64
 7   TDC1            24152 non-null  float64
 8   TDC2            28953 non-null  float64
 9   TOTAL_ALT1_PCT  0 non-null      float64
 10  TOTAL_ALT2_PCT  0 non-null      float64
 11  GVKEY           28953 non-null  int64
 12  YEAR            28953 non-null  int64
 13  TICKER          28953 non-null  object
dtypes: float64(9), int64(4), object(1)
memory usage: 3.1+ MB